import React, { useState } from "react";
import { Button } from "antd";
import { IoIosArrowBack } from "react-icons/io";
export default function Collaboration() {
  return (
    <div
      dir="rtl"
      className="flex flex-col space-y-5 text-ellipsis justify-items-center text-black text-right  m-14 p-14 "
    >
      <h1 className="font-bold place-self-center text-xl mb-7">همکاری تجاری</h1>
      <b>بانک، ولی دوست‌داشتنی </b>
      <p>
        بعد از رونمایی بلو در اسفند ماه سال 1399، کاربران زیادی از سراسر ایران
        به سرعت جذب این بانک شدند. بلو به‌دلیل سادگی و راحتی عملکرد و
        جذابیت‌هایی که برای کاربران خود فراهم کرد، توانست سریع‌ترین نرخ رشد
        تعداد کاربر در بین تمامی بانک‌های کشور را به‌دست آورد. عموم این کاربران
        بین 18 تا 40 سال سن دارند. بلو، نه شعبه فیزیکی دارد و نه تعطیلی.
        سرمایه‌ی بلو، رضایت کاربرانی است که روز به روز به تعداد آن‌ها افزوده
        می‌شود؛ چرا که همه‌ی کارها در بلو حول یک ارزش می‌چرخد: این تجربه‌‌، قرار
        است دوست‌داشتنی باشد.
      </p>
      <b>چرا با بلو؟ </b>
      <p>
        همکاری با بلو، یک تجربه دوست‌داشتنی برای شما خواهد ساخت. باز کردن حساب
        حقوقی، امکان برداشت و انتقال وجه با استفاده از پلتفرم بلوبیز، شارژ حساب
        پرنسل در قالب بن‌باکس، امکان استفاده از سرویس پاداش بلو، از قابلیت‌هایی
        است که می‌تواند این همکاری را برای شما متمایز کند.
      </p>
      <b>وام سازمانی</b>
      <p>
        بلو می‎تواند با پرداخت وام‌های متنوع، به افزایش رفاه و ماندگاری پرسنل
        شما کمک کند. همه‌ی پرسنل سازمانی که پیمان دوستی با بلو امضا کرده‌اند،
        می‌توانند متناسب با توان مالی خود، تا سقف 200 میلیون تومان و در اقساط 6،
        9 و 12 ماهه، وام بگیرند؛ آنلاین، به ‌آسانی و بدون نیاز به ضامن.
      </p>
      <b>وام خرید کالا</b>
      <p>
        بلو امکان پرداخت وام به پلتفرم‌های وام‌دهی و لندتک را فراهم کرده است تا
        آن‌ها بتوانند با دریافت ضمانت از مشتریان خود، وام فوری خرید کالا و خدمات
        بدهند.{" "}
        <p className="underline">
          دریافت این وام بدون ضامن و بدون مراجعه حضوری خواهد بود.
        </p>{" "}
        سقف این وام 100 میلیون تومان است که توسط پلتفرم‌ها در اختیار مشتریان
        قرار می‌گیرد تا از پذیرنده‌های طرف قراردادشان، بتوانند خرید کنند یا
        خدمات بگیرند.
      </p>
      <b className="underline">بن باکس</b>
      <p>
        در عصر تکنولوژی و روزگار نگرانی برای قطع شدن درخت‌ها، بن‌های فیزیکی دیگر
        جایی ندارند. بن باکس بلو، فضایی در اپلیکیشن بلوست که می‌توان آن را به
        میزان دل‌خواه، شارژ کرد. سازمان‌ها می‌توانند مبلغ‌های مشخصی را در قالب
        بن باکس برای پرسنل خود شارژ کنند تا این بودجه رفاهی در اختیار آن‌ها قرار
        بگیرد. این سرویس امکان محدود شدن به یک یا چند فروشگاه و درگاه را دارد.
        آیا از همه‌ی مزایای بن‌باکس خبر دارید؟
      </p>
      <ul className="list-disc">
        <li>خرید با بلوکارت بدون نیاز به کارت دیگر</li>
        <li>امکان محدود کردن پایانه‌ی فروش (فیزیکی یا آنلاین)</li>
        <li>
          امکان مشخص کردن فروشگاه‌های طرف قرارداد و مشاهده‌ی لیست آن‌ها در
          اپلیکیشن بلو
        </li>
        <li>امکان محدود کردن اصناف طرف قرارداد</li>
        <li>امکان مشاهده‌ی جزییات تراکنش‌های اعتباری</li>
        <li>
          امکان خرید بیش از مبلغ تعیین شده و پرداخت مازاد وجه از حساب کاربر،
          تنها در یک تراکنش
        </li>
      </ul>
      <b className="underline">برگشت پول بلو</b>
      <p>
        یک تخفیف همیشگی، به افزایش فروش فروشگاه شما کمک می‌کند. تجربه خرید برای
        مشتریانی که بلوکارت دارند، یک تجربه‌ی متفاوت خواهد بود؛ چراکه درصد مشخصی
        از هزینه‌ی پرداخت شده به حساب آن‌ها برمی‌گردد. برگشت پول به حساب درست
        چند لحظه بعد از پرداخت به‌سرعت اتفاق می‌افتد و نیاز به انجام کار دیگری
        توسط مشتری نیست. مزایای سرویس پاداش یا برگشت پول، را بخوانید و به آن‌ها
        آگاه باشید:
      </p>
      <ul className="rtl:list-disc">
        <li>قرار گرفتن فروشگاه شما در اپلیکیشن بلو و معرفی به کاربران</li>
        <li>
          امکان برگشت نیم تا 10 درصدی از مبلغ خرید در هر تراکنش به حساب مشتری
        </li>
        <li>امکان پس‌انداز مبلغ‌های برگشت داده در یک باکس جداگانه</li>
        <li>امکان توسعه‌ی همکاری با فروشگاه‌های محبوب</li>
      </ul>
      <p>
        سازمان‌ها و‌ شرکت‌هایی که تمایل به همکاری در هر یک از این طرح‌ها دارند؛
        می‌توانند برای به دست آوردن اطلاعات بیشتر، درخواست خود را از طریق ایمیل‌
        زیر ارسال کنند.
      </p>
      <Button type="link">
        <b>Partnerships@bluteam.ir</b>
      </Button>
      <Button type="link" className="flex justify-end">
        <div className="mt-14 flex flex-row justify-end">
          <p>بعدی</p>
          <IoIosArrowBack className="size-7" />
        </div>
      </Button>
    </div>
  );
}
